app/controllers/api/merchandises_controller.rb

      def index
        @merchandises = Merchandise.all
        if title = params[:title]
            @merchandises = @merchandises.where(title: title)
        end
        if price = params[:price]
            @merchandises = @merchandises.where(price: price)
---
SELECT "merchandises".* FROM "merchandises"
SELECT "merchandises".* FROM "merchandises" WHERE "merchandises"."title" = ?  [["title", "Galaxy"]]
SELECT "merchandises".* FROM "merchandises" WHERE "merchandises"."title" = ? AND "merchandises"."price" = ?  [["title", "2B Pencil"], ["price", 20]]

      def create
        @merchandise = Merchandise.new(merchandise_params)
        if @merchandise.save
---
INSERT INTO "merchandises" ("title", "description", "price", "amount", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

      def update
        if @merchandise.update(merchandise_params)
---
UPDATE "merchandises" SET "title" = ?, "updated_at" = ? WHERE "merchandises"."id" = ?  [["title", "cURL merchandise updated"], ["updated_at", "2016-06-10 08:25:25.814472"], ["id", 13]]

      def destroy
        @merchandise.destroy
---
DELETE FROM "merchandises" WHERE "merchandises"."id" = ?  [["id", 14]]

      def set_merchandise
        @merchandise = Merchandise.find(params[:id])
---
SELECT  "merchandises".* FROM "merchandises" WHERE "merchandises"."id" = ? LIMIT 1  [["id", 14]]