RoR/app/controllers/users_controller.rb

    def create
        @user = User.new(create_user_params)
        if @user.save
---
INSERT INTO "users" ("username", "email", "mobile", "password_digest", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def update
        if @user.update(update_user_params)
---
UPDATE "users" SET "avatar_file_name" = ?, "avatar_content_type" = ?, "avatar_file_size" = ?, "avatar_updated_at" = ?, "updated_at" = ? WHERE "users"."id" = ?