RoR/app/views/categories/index.html.erb

            <%= link_to "#{category.name}", category_path(category) %>
            <% category.subcategories.each do |subcategory| %>
---
SELECT "categories".* FROM "categories"