RoR/app/views/users/index.html.erb

SELECT COUNT(*) FROM "merchandises" WHERE "merchandises"."user_id" = ?  [["user_id", 1]]
---
            <br />
            <small><%= pluralize(user.merchandises.count, "merchandise") if user.merchandises %></small>