RoR/app/controllers/api/categories_controller.rb

SELECT "categories".* FROM "categories"
SELECT "categories".* FROM "categories" WHERE "categories"."name" = ?  [["name", "Sports"]]
---
      def index
        @categories = Category.all
        if name = params[:name]
            @categories = @categories.where(name: name)