RoR/app/controllers/api/users_controller.rb

  def index
    @users = User.all
    if username = params[:username]
        @users = @users.where(username: username)
    end
    if email = params[:email]
        @users = @users.where(email: email)
---
SELECT "users".* FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "absoluteyl"]]
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "absoluteyl"]]