RoR/app/views/layouts/_navigation.html.erb

              <li role="separator" class="divider"></li>
              <% Category.where(:parent_id => nil).each do |category| %>
---
SELECT "categories".* FROM "categories" WHERE "categories"."parent_id" IS NULL