app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."parent_id" = ?  [["parent_id", 1]]
---
    def index
        # Display all the parent categories
        @categories = Category.where(:parent_id => nil)

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]
---
    def show
      # Find the category belonging to the given id
      @category = Category.find(params[:id])

SELECT "categories".* FROM "categories" WHERE "categories"."parent_id" IS NULL
---
    def new
        @category = Category.new
        @category.parent = Category.find(params[:id]) unless params[:id].nil?

INSERT INTO "categories" ("name", "parent_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Men's Athletic Clothing"], ["parent_id", 1], ["created_at", "2016-06-08 01:33:52.853314"], ["updated_at", "2016-06-08 01:33:52.853314"]]
---
    def create
        @category = Category.new(category_params)
        if @category.save

UPDATE "categories" SET "name" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["name", "--Sports--"], ["updated_at", "2016-06-13 07:21:30.193958"], ["id", 1]]
---
    def update
        if @category.update(category_params)