app/controllers/merchandises_controller.rb

INSERT INTO "merchandises" ("title", "description", "price", "amount", "image_1_file_name", "image_1_content_type", "image_1_file_size", "image_1_updated_at", "image_2_file_name", "image_2_content_type", "image_2_file_size", "image_2_updated_at", "image_3_file_name", "image_3_content_type", "image_3_file_size", "image_3_updated_at", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
      @merchandise = Merchandise.new(merchandise_params)
      @merchandise.user = current_user
      if @merchandise.save

SELECT "merchandises".* FROM "merchandises"
---
    def index
      @merchandise = Merchandise.all

UPDATE "merchandises" SET "image_1_file_name" = ?, "image_1_content_type" = ?, "image_1_file_size" = ?, "image_1_updated_at" = ?, "image_2_file_name" = ?, "image_2_content_type" = ?, "image_2_file_size" = ?, "image_2_updated_at" = ?, "image_3_file_name" = ?, "image_3_content_type" = ?, "image_3_file_size" = ?, "image_3_updated_at" = ?, "updated_at" = ? WHERE "merchandises"."id" = ?
---
    def update
        if @merchandise.update(merchandise_params)

DELETE FROM "merchandises" WHERE "merchandises"."id" = ?  [["id", 4]]
---
    def destroy
      @merchandise.destroy

SELECT  "merchandises".* FROM "merchandises" WHERE "merchandises"."id" = ? LIMIT 1  [["id", 4]]
---
    def set_merchandise
      @merchandise = Merchandise.find(params[:id])

SELECT "categories".* FROM "categories" WHERE "categories"."parent_id" IS NULL
---
    def set_category
        @categories = Category.where(parent_id: nil)