app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "mobile", "password_digest", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        @user = User.new(create_user_params)
        if @user.save

UPDATE "users" SET "avatar_file_name" = ?, "avatar_file_size" = ?, "avatar_updated_at" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["avatar_file_name", "flower1.png"], ["avatar_file_size", 41191], ["avatar_updated_at", "2016-06-14 05:02:33.427275"], ["updated_at", "2016-06-14 05:02:33.979712"], ["id", 2]]
---
    def update
        if @user.update(update_user_params)