app/views/categories/_form.html.erb

SELECT "categories".* FROM "categories" WHERE "categories"."parent_id" IS NULL
---
    <%= f.label :parent %>
    <%= f.collection_select(:parent_id, Category.where(parent_id: nil), :id, :name, prompt: true) %>