app/views/categories/index.html.erb

            <!-- Remove subcategories display temporary -->
            <!--<%# category.subcategories.each do |subcategory| %>-->
---
SELECT "categories".* FROM "categories"