app/views/categories/new.html.erb

SELECT "categories".* FROM "categories" WHERE "categories"."parent_id" IS NULL
---
    <%= f.label :parent %>
    <%= f.collection_select(:parent_id, Category.all, :id, :name, prompt: true) %>